def sum_multiplied_2(card):
    count = []
    str_card = str(card)
    numbers_with_step = int(str_card[::2])
    for i in str(numbers_with_step):
        count.append(int(i) * 2)
    count_str = ''.join(map(str, count))
    return count_str

def sum_of_place_numbers(card):
    place_nubmers = 0
    for i in sum_multiplied_2(card):
        place_nubmers += int(i)
    print(place_nubmers)

probe_1 = sum_of_place_numbers(card = 4003600000000014)



# Давайте спочатку підкреслимо всі розряди, що будуть помножені на 2 (кожен другий, рахуючи з передостаннього):
# 4003600000000014
# Добре, давайте помножимо кожен виділений розряд на 2:
# 1•2 + 0•2 + 0•2 + 0•2 + 0•2 + 6•2 + 0•2 + 4•2
# Це дасть нам:
# 2 + 0 + 0 + 0 + 0 + 12 + 0 + 8
# Давайте тепер додамо розряди цих добутків (не самі добутки):
# 2 + 0 + 0 + 0 + 0 + 1 + 2 + 0 + 8 = 13
# Тепер давайте додамо цю суму (13) до суми розрядів, що не були помножені на 2, почавши з кінця:
# 13 + 4 + 0 + 0 + 0 + 0 + 0 + 3 + 0 = 20
# Так, останній розряд отриманої суми (20) - це 0, а, отже, номер карти Девіда справжній!
# Отже, валідація номеру кредитки нескладна, але її трохи незручно робити вручну. Давайте напишемо для цього програму.




